RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_lvd_ht.h
#define CY_LVD_HT_CHECK_LVD_SELECT(lvdNum)   (((lvdNum) == CY_LVD_HT_SELECT_LVD_1) || \
                                              ((lvdNum) == CY_LVD_HT_SELECT_LVD_2))

/** \endcond */

/**
* \addtogroup group_lvd_ht_functions
* \{
*/
__STATIC_INLINE void Cy_LVD_HT_Enable(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE void Cy_LVD_HT_Disable(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE void Cy_LVD_HT_SetThreshold(cy_en_lvd_ht_select_t lvdNum, cy_en_lvd_ht_tripsel_t threshold);
__STATIC_INLINE cy_en_lvd_ht_status_t Cy_LVD_HT_GetStatus(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE uint32_t Cy_LVD_HT_GetInterruptStatus(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE void Cy_LVD_HT_ClearInterrupt(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE void Cy_LVD_HT_SetInterrupt(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE uint32_t Cy_LVD_HT_GetInterruptMask(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE void Cy_LVD_HT_SetInterruptMask(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE void Cy_LVD_HT_ClearInterruptMask(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE uint32_t Cy_LVD_HT_GetInterruptStatusMasked(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE void Cy_LVD_HT_SetInterruptConfig(cy_en_lvd_ht_select_t lvdNum, cy_en_lvd_ht_intr_config_t lvdInterruptConfig);
__STATIC_INLINE void Cy_LVD_HT_DeepSleepEnable(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE void Cy_LVD_HT_DeepSleepDisable(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE void Cy_LVD_HT_SetActionConfig(cy_en_lvd_ht_select_t lvdNum, cy_en_lvd_ht_action_config_t lvdActionConfig);
__STATIC_INLINE cy_en_lvd_ht_action_config_t Cy_LVD_HT_GetActionConfig(cy_en_lvd_ht_select_t lvdNum);
__STATIC_INLINE bool Cy_LVD_HT_IsDeepSleepEnabled(cy_en_lvd_ht_select_t lvdNum);

/** \addtogroup group_lvd_ht_functions_syspm_callback
* The driver supports SysPm callback for Deep Sleep transition.
* \{
*/
cy_en_syspm_status_t Cy_LVD_HT_DeepSleepCallback(cy_stc_syspm_callback_params_t * callbackParams, cy_en_syspm_callback_mode_t mode);
/** \} */

/*******************************************************************************
* Function Name: Cy_LVD_HT_Enable
****************************************************************************//**
*
*  Enables the output of the LVD block when the VDDD voltage crosses the
* threshold.
*  See the Configuration Considerations section for details.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_Enable(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_PWR_LVD_CTL |= SRSS_PWR_LVD_CTL_HVLVD1_EN_HT_Msk;
    }
    else
    {
        SRSS_PWR_LVD_CTL2 |= SRSS_PWR_LVD_CTL2_HVLVD2_EN_HT_Msk;
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_Disable
****************************************************************************//**
*
*  Disables a particular LVD. A low voltage detection interrupt is disabled.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_Disable(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_PWR_LVD_CTL &= (uint32_t) ~SRSS_PWR_LVD_CTL_HVLVD1_EN_HT_Msk;
    }
    else
    {
        SRSS_PWR_LVD_CTL2 &= (uint32_t) ~SRSS_PWR_LVD_CTL2_HVLVD2_EN_HT_Msk;
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_SetThreshold
****************************************************************************//**
*
*  Sets a threshold for monitoring the VDDD voltage.
*  To prevent propagating a false interrupt, before changing the threshold
*  ensure that the LVD block itself and LVD interrupt are disabled by the
*  \ref Cy_LVD_HT_Disable and \ref Cy_LVD_HT_ClearInterruptMask functions
*  correspondingly.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*  \param threshold
*  Threshold selection for Low Voltage Detect circuit, \ref cy_en_lvd_ht_tripsel_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_SetThreshold(cy_en_lvd_ht_select_t lvdNum, cy_en_lvd_ht_tripsel_t threshold)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));
    CY_ASSERT_L3(CY_LVD_HT_CHECK_TRIPSEL(threshold));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_PWR_LVD_CTL = _CLR_SET_FLD32U(SRSS_PWR_LVD_CTL, SRSS_PWR_LVD_CTL_HVLVD1_TRIPSEL_HT, threshold);
    }
    else
    {
        SRSS_PWR_LVD_CTL2 = _CLR_SET_FLD32U(SRSS_PWR_LVD_CTL2, SRSS_PWR_LVD_CTL2_HVLVD2_TRIPSEL_HT, threshold);
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_GetStatus
****************************************************************************//**
*
*  Returns the status of selected LVD.
*  SRSS LVD Status Register (PWR_LVD_STATUS).
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*  \return LVD status, \ref cy_en_lvd_ht_status_t.
*
*******************************************************************************/
__STATIC_INLINE cy_en_lvd_ht_status_t Cy_LVD_HT_GetStatus(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','SRSS_PWR_LVD_STATUS_HVLVD1_OUT_Msk extracts only 1 bit value');
        return ((cy_en_lvd_ht_status_t) _FLD2VAL(SRSS_PWR_LVD_STATUS_HVLVD1_OUT, SRSS_PWR_LVD_STATUS));
    }
    else
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','SRSS_PWR_LVD_STATUS2_HVLVD2_OUT_Msk extracts only 1 bit value');
        return ((cy_en_lvd_ht_status_t) _FLD2VAL(SRSS_PWR_LVD_STATUS2_HVLVD2_OUT, SRSS_PWR_LVD_STATUS2));

