RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_lvd_ht.h
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_GetInterruptStatus
****************************************************************************//**
*
*  Returns the status of selected LVD's interrupt.
*  SRSS Interrupt Register (SRSS_INTR).
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*  \return SRSS Interrupt status
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_LVD_HT_GetInterruptStatus(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        return (SRSS_SRSS_INTR & SRSS_SRSS_INTR_HVLVD1_Msk);
    }
    else
    {
        return (SRSS_SRSS_INTR & SRSS_SRSS_INTR_HVLVD2_Msk);
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_ClearInterrupt
****************************************************************************//**
*
*  Clears LVD interrupt.
*  SRSS Interrupt Register (SRSS_INTR).
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_ClearInterrupt(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_SRSS_INTR = SRSS_SRSS_INTR_HVLVD1_Msk;
    }
    else
    {
        SRSS_SRSS_INTR = SRSS_SRSS_INTR_HVLVD2_Msk;
    }

    (void) SRSS_SRSS_INTR;
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_SetInterrupt
****************************************************************************//**
*
*  Triggers the device to generate interrupt for LVD.
*  SRSS Interrupt Set Register (SRSS_INTR_SET).
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_SetInterrupt(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_SRSS_INTR_SET |= SRSS_SRSS_INTR_SET_HVLVD1_Msk;
    }
    else
    {
        SRSS_SRSS_INTR_SET |= SRSS_SRSS_INTR_SET_HVLVD2_Msk;
    }
}


/*******************************************************************************
* Function Name:  Cy_LVD_HT_GetInterruptMask
****************************************************************************//**
*
*  Returns the mask value of LVD interrupts.
*  SRSS Interrupt Mask Register (SRSS_INTR_MASK).
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*  \return SRSS Interrupt Mask value
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_LVD_HT_GetInterruptMask(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        return (SRSS_SRSS_INTR_MASK & SRSS_SRSS_INTR_MASK_HVLVD1_Msk);
    }
    else
    {
        return (SRSS_SRSS_INTR_MASK & SRSS_SRSS_INTR_MASK_HVLVD2_Msk);
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_SetInterruptMask
****************************************************************************//**
*
* Enables LVD interrupts.
* Sets the LVD interrupt mask in the SRSS_INTR_MASK register.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_SetInterruptMask(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_SRSS_INTR_MASK |= SRSS_SRSS_INTR_MASK_HVLVD1_Msk;
    }
    else
    {
        SRSS_SRSS_INTR_MASK |= SRSS_SRSS_INTR_MASK_HVLVD2_Msk;
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_ClearInterruptMask
****************************************************************************//**
*
* Disables LVD interrupts.
* Clears the LVD interrupt mask in the SRSS_INTR_MASK register.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_ClearInterruptMask(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_SRSS_INTR_MASK &= (uint32_t) ~SRSS_SRSS_INTR_MASK_HVLVD1_Msk;
    }
    else
    {
        SRSS_SRSS_INTR_MASK &= (uint32_t) ~SRSS_SRSS_INTR_MASK_HVLVD2_Msk;
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_GetInterruptStatusMasked
****************************************************************************//**
*
*  Returns the masked interrupt status which is a bitwise AND between the
*  interrupt status and interrupt mask registers.
*  SRSS Interrupt Masked Register (SRSS_INTR_MASKED).
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*  \return SRSS Interrupt Masked value
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_LVD_HT_GetInterruptStatusMasked(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        return (SRSS_SRSS_INTR_MASKED & SRSS_SRSS_INTR_MASK_HVLVD1_Msk);
    }
    else
    {
        return (SRSS_SRSS_INTR_MASKED & SRSS_SRSS_INTR_MASK_HVLVD2_Msk);
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_SetInterruptConfig
****************************************************************************//**
*
*  Sets a configuration for specified LVD interrupt.
*  HVLVD Configuration Register (PWR_LVD_CTL or PWR_LVD_CTL2).
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*  \param lvdInterruptConfig \ref cy_en_lvd_ht_intr_config_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_SetInterruptConfig(cy_en_lvd_ht_select_t lvdNum, cy_en_lvd_ht_intr_config_t lvdInterruptConfig)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));
    CY_ASSERT_L3(CY_LVD_HT_CHECK_INTR_CFG(lvdInterruptConfig));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_PWR_LVD_CTL = _CLR_SET_FLD32U(SRSS_PWR_LVD_CTL, SRSS_PWR_LVD_CTL_HVLVD1_EDGE_SEL, lvdInterruptConfig);
    }
    else
    {
        SRSS_PWR_LVD_CTL2 = _CLR_SET_FLD32U(SRSS_PWR_LVD_CTL2, SRSS_PWR_LVD_CTL2_HVLVD2_EDGE_SEL, lvdInterruptConfig);
    }
}

