RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_lvd_ht.h
/*******************************************************************************
* Function Name: Cy_LVD_HT_SetActionConfig
****************************************************************************//**
*
*  Sets a action configuration after LVD block reaches threshold.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*  \param lvdActionConfig \ref cy_en_lvd_ht_action_config_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_SetActionConfig(cy_en_lvd_ht_select_t lvdNum, cy_en_lvd_ht_action_config_t lvdActionConfig)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));
    CY_ASSERT_L3(CY_LVD_HT_CHECK_ACTION_CFG(lvdActionConfig));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_PWR_LVD_CTL = _CLR_SET_FLD32U(SRSS_PWR_LVD_CTL, SRSS_PWR_LVD_CTL_HVLVD1_ACTION, lvdActionConfig);
    }
    else
    {
        SRSS_PWR_LVD_CTL2 = _CLR_SET_FLD32U(SRSS_PWR_LVD_CTL2, SRSS_PWR_LVD_CTL2_HVLVD2_ACTION, lvdActionConfig);
    }
}

/*******************************************************************************
* Function Name: Cy_LVD_HT_GetActionConfig
****************************************************************************//**
*
*  Gets the action configured after LVD reaches threshold.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*  \return \ref cy_en_lvd_ht_action_config_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_lvd_ht_action_config_t Cy_LVD_HT_GetActionConfig(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        return (((SRSS_PWR_LVD_CTL & SRSS_PWR_LVD_CTL_HVLVD1_ACTION_Msk) != 0UL) ? CY_LVD_HT_ACTION_FAULT : CY_LVD_HT_ACTION_INTERRUPT);
    }
    else
    {
        return (((SRSS_PWR_LVD_CTL2 & SRSS_PWR_LVD_CTL2_HVLVD2_ACTION_Msk) != 0UL) ? CY_LVD_HT_ACTION_FAULT : CY_LVD_HT_ACTION_INTERRUPT);
    }
}

/*******************************************************************************
* Function Name: Cy_LVD_HT_DeepSleepEnable
****************************************************************************//**
*
*  Enables selected LVD block during Deep Sleep.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
* \note
* For enabling, call this API before the system enters first DEEPSLEEP entry,
* else if we enable in the second or subsequent DEEPSLEEP entries then it might
* not wake the system from DEEPSLEEP through LVD.
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_DeepSleepEnable(cy_en_lvd_ht_select_t lvdNum)
{
    CY_ASSERT_L3(CY_LVD_HT_CHECK_LVD_SELECT(lvdNum));

    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_PWR_LVD_CTL |= SRSS_PWR_LVD_CTL_HVLVD1_DPSLP_EN_HT_Msk;
    }
    else
    {
        SRSS_PWR_LVD_CTL2 |= SRSS_PWR_LVD_CTL2_HVLVD2_DPSLP_EN_HT_Msk;
    }
}


/*******************************************************************************
* Function Name: Cy_LVD_HT_DeepSleepDisable
****************************************************************************//**
*
*  Disables selected LVD block during Deep Sleep.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
* \note
* After Cy_LVD_HT_DeepSleepDisable call, you have to reinitialize LVD according
* to recommended LVD Init sequence, else it might not wake the system from
* DEEPSLEEP through LVD after calling Cy_LVD_HT_DeepSleepEnable.
*
*******************************************************************************/
__STATIC_INLINE void Cy_LVD_HT_DeepSleepDisable(cy_en_lvd_ht_select_t lvdNum)
{
    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        SRSS_PWR_LVD_CTL &= (uint32_t) ~SRSS_PWR_LVD_CTL_HVLVD1_DPSLP_EN_HT_Msk;
    }
    else
    {
        SRSS_PWR_LVD_CTL2 &= (uint32_t) ~SRSS_PWR_LVD_CTL2_HVLVD2_DPSLP_EN_HT_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_LVD_HT_IsDeepSleepEnabled
****************************************************************************//**
*
*  Checks if LVD HT is enabled during Deep Sleep or not.
*
*  \param lvdNum
*   Selects the LVD, \ref cy_en_lvd_ht_select_t
*
*  \return - True if LVD HT is enabled during Deep Sleep, otherwise False.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_LVD_HT_IsDeepSleepEnabled(cy_en_lvd_ht_select_t lvdNum)
{
    if(lvdNum == CY_LVD_HT_SELECT_LVD_1)
    {
        return (((SRSS_PWR_LVD_CTL & SRSS_PWR_LVD_CTL_HVLVD1_DPSLP_EN_HT_Msk) != 0UL) ? true : false);
    }
    else
    {
        return (((SRSS_PWR_LVD_CTL2 & SRSS_PWR_LVD_CTL2_HVLVD2_DPSLP_EN_HT_Msk) != 0UL) ? true : false);
    }
}


/** \} group_lvd_ht_functions */

#ifdef __cplusplus
}
#endif

#endif /* CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3) */

#endif /* CY_LVD_HT_H */

/** \} group_lvd_ht */


/* [] END OF FILE */
